Tried to clone using the hostname since that seems to catch the template image but the plugin crashes

```
terraform apply  

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_lxc.basic will be created
  + resource "proxmox_lxc" "basic" {
      + arch         = "amd64"
      + clone        = "ubuntu-template"
      + cmode        = "tty"
      + console      = true
      + cpulimit     = 0
      + cpuunits     = 1024
      + current_node = (known after apply)
      + full         = true
      + hostname     = "lxc-clone"
      + id           = (known after apply)
      + memory       = 512
      + onboot       = false
      + ostype       = (known after apply)
      + protection   = false
      + start        = true
      + swap         = 0
      + target_node  = "not"
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = (known after apply)
    }

  # proxmox_lxc.ubuntu_template will be created
  + resource "proxmox_lxc" "ubuntu_template" {
      + arch         = "amd64"
      + cmode        = "tty"
      + console      = true
      + cores        = 2
      + cpulimit     = 0
      + cpuunits     = 1024
      + current_node = (known after apply)
      + description  = "Managed by Terraform"
      + hostname     = "ubuntu-template"
      + id           = (known after apply)
      + memory       = 2048
      + onboot       = false
      + ostemplate   = "local:vztmpl/ubuntu-24.04-standard_24.04-2_amd64.tar.zst"
      + ostype       = (known after apply)
      + protection   = false
      + start        = false
      + swap         = 0
      + target_node  = "not"
      + template     = true
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = (known after apply)

      + rootfs {
          + size    = "20G"
          + storage = "local-lvm"
          + volume  = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

proxmox_lxc.ubuntu_template: Creating...
proxmox_lxc.ubuntu_template: Creation complete after 5s [id=not/lxc/101]
proxmox_lxc.basic: Creating...
╷
│ Error: Plugin did not respond
│ 
│   with proxmox_lxc.basic,
│   on compute.tf line 23, in resource "proxmox_lxc" "basic":
│   23: resource "proxmox_lxc" "basic" {
│ 
│ The plugin encountered an error, and failed to respond to the plugin.(*GRPCProvider).ApplyResourceChange call. The plugin logs may contain more details.
╵

Stack trace from the terraform-provider-proxmox_v3.0.2-rc04 plugin:

panic: assignment to entry in nil map

goroutine 115 [running]:
github.com/Telmate/terraform-provider-proxmox/v2/proxmox.resourceLxcCreate({0x102cc52d8, 0x140002260e0}, 0x14000824000, {0x102b0c140, 0x14000b828c0})
        github.com/Telmate/terraform-provider-proxmox/v2/proxmox/resource_lxc.go:596 +0x1dc0
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).create(0x14000577d00, {0x102cc5230, 0x14000911c80}, 0x14000824000, {0x102b0c140, 0x14000b828c0})
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/schema/resource.go:849 +0xe4
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).Apply(0x14000577d00, {0x102cc5230, 0x14000911c80}, 0x1400066dd40, 0x140008250e0, {0x102b0c140, 0x14000b828c0})
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/schema/resource.go:980 +0x8e8
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*GRPCProviderServer).ApplyResourceChange(0x14000370000, {0x102cc5230?, 0x14000911bc0?}, 0x1400065eaa0)
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.37.0/helper/schema/grpc_provider.go:1484 +0xd48
github.com/hashicorp/terraform-plugin-go/tfprotov5/tf5server.(*server).ApplyResourceChange(0x1400028c000, {0x102cc5230?, 0x140009113e0?}, 0x14000473c00)
        github.com/hashicorp/terraform-plugin-go@v0.28.0/tfprotov5/tf5server/server.go:941 +0x294
github.com/hashicorp/terraform-plugin-go/tfprotov5/internal/tfplugin5._Provider_ApplyResourceChange_Handler({0x102c96ea0, 0x1400028c000}, {0x102cc5230, 0x140009113e0}, 0x14000473b80, 0x0)
        github.com/hashicorp/terraform-plugin-go@v0.28.0/tfprotov5/internal/tfplugin5/tfplugin5_grpc.pb.go:687 +0x1c0
google.golang.org/grpc.(*Server).processUnaryRPC(0x1400026e400, {0x102cc5230, 0x14000911350}, 0x14000850d80, 0x14000597e30, 0x103307208, 0x0)
        google.golang.org/grpc@v1.72.1/server.go:1405 +0xc9c
google.golang.org/grpc.(*Server).handleStream(0x1400026e400, {0x102cc5b30, 0x14000156000}, 0x14000850d80)
        google.golang.org/grpc@v1.72.1/server.go:1815 +0x900
google.golang.org/grpc.(*Server).serveStreams.func2.1()
        google.golang.org/grpc@v1.72.1/server.go:1035 +0x84
created by google.golang.org/grpc.(*Server).serveStreams.func2 in goroutine 39
        google.golang.org/grpc@v1.72.1/server.go:1046 +0x138

Error: The terraform-provider-proxmox_v3.0.2-rc04 plugin crashed!

This is always indicative of a bug within the plugin. It would be immensely
helpful if you could report the crash with the plugin's maintainers so that it
can be fixed. The output above should help diagnose the issue.
```

The clone is created but not started.